/* ****************************************************************************************************************************
 * ***************************************************** 主函数模块 ***********************************************************
 * ****************************************************************************************************************************/
#include "header.h"
#include <stdbool.h>

/* 函数原型 */
void read_cards(void);
void analyze_hand(void);
void print_result(void);


/* 主函数只负责无限循环调用这三个子函数，每进行一次循环就相当于进行一轮游戏 */
int main(void)
{
    while (true)
    {
        read_cards();
        analyze_hand();
        print_result();
    }

    return 0;
}

